Работа со списками "Регистрация и авторизация "


Напишите программу имитирующую регистрацию и авторизацию пользователей в какой-либо системе.

До начала работы программы создайте 2 пустых или заполненых несколькими значениями списка(пароли и логины), которые будут заполняться по мере регистрации новых пользователей.

Реализация регистрации и авторизации осуществичется при помощи функций. Обязательно описание функций!!!

В бесконечном цикле на каждом его ветке предлагайте пройти регистрацию, авторизироваться или закончить работу.

При выборе "авторизироваться":

разрешить это делать только пользователям из списка.
и если логин и пароль соответствуют значениям из списков
При выборе "регистрироваться" две возможности:

автоматическое создание пароля
самостоятельное
При варианте автоматическое создание пароля, воспользуйтесь ниже приведенным кодом программы:

import random
str0=".,:;!_*-+()/#¤%&"
str1 = '0123456789'
str2 = 'qwertyuiopasdfghjklzxcvbnm'
str3 = str2.upper()
print(str3) # 'QWERTYUIOPASDFGHJKLZXCVBNM'
str4 = str0+str1+str2+str3
print(str4)
ls = list(str4)
print(ls)
random.shuffle(ls)
print(ls)
# Извлекаем из списка 12 произвольных значений
psword = ''.join([random.choice(ls) for x in range(12)])
# Пароль готов
print(psword)

Если самостоятельное создание пароля, то проверяете пароль на содержание в нем

цифр,
букв в нижнем,
букв в верхнем регистре и
спец. символов.
Для проверки этих условий могут пригодиться такие функции как:

isdigit() -является ли переменная числом,

isupper() - введена ли большая буква,

Примеры использования данных функций:

1-

i=input("Введи букву => ")
if(i.isupper()):
    print("Вы ввели заглавную букву ", i)
a=input("Введи цифру => ")
if (a.isdigit()):
    print("Вы ввели цифру ", a)

2-

c=input(" - ")
if (c.isupper()):
     print("Заглавная буква - ", c )
elif (c.isdigit()):
     print("Цифра - ", c )